Revit 2016 API
PlanarFace Members
The PlanarFace type exposes the following members.
Methods
Name | Description
ComputeDerivatives
Returns the vectors describing the face at the specified point.
 (Inherited from Face.)
ComputeNormal
Returns the normal vector for the face at the given point.
 (Inherited from Face.)
ComputeSecondDerivatives
Returns the second partial derivatives of the face at the specified point.
 (Inherited from Face.)
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from GeometryObject.)
Evaluate
Evaluates parameters on the face.
 (Inherited from Face.)
GetBoundingBox
Returns the UV bounding box of the face.
 (Inherited from Face.)
GetEdgesAsCurveLoops
Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
 (Inherited from Face.)
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Inherited from GeometryObject.)
GetRegions
Face regions (created with the Split Face command) of the face.
 (Inherited from Face.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Intersect(Curve)
Calculates the intersection of the specified curve with this face.
 (Inherited from Face.)
Intersect(Face)
Calculates the intersection of the specified face with this face and returns the intersection results.
 (Inherited from Face.)
Intersect(Curve, IntersectionResultArray)
Calculates the intersection of the specified curve with this face and returns the intersection results.
 (Inherited from Face.)
Intersect(Face, Curve)
Calculates the intersection of the specified face with this face and returns the intersection results.
 (Inherited from Face.)
IsInside(UV)
Indicates whether the specified point is within this face.
 (Inherited from Face.)
IsInside(UV, IntersectionResult)
Indicates whether the specified point is within this face and outputs additional results.
 (Inherited from Face.)
Project
Projects the specified point on this face.
 (Inherited from Face.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Triangulate()
Returns a triangular mesh approximation to the face.
 (Inherited from Face.)
Triangulate(Double)
Returns a triangular mesh approximation to the face.
 (Inherited from Face.)
Properties
Name | Description
Area
The area of this face.
 (Inherited from Face.)
EdgeLoops
Each edge loop is a closed boundary of the face.
 (Inherited from Face.)
FaceNormal
Normal of the planar face.
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
HasRegions
Reports if the face contains regions created with the Split Face command.
 (Inherited from Face.)
IsCyclic
The boolean value that indicates whether this face is periodic in the specified parametric direction.
 (Inherited from Face.)
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsTwoSided
Determines if a face is two-sided (degenerate)
 (Inherited from Face.)
MaterialElementId
Element ID of the material from which this face is composed.
 (Inherited from Face.)
Normal |  Obsolete.
Normal of the planar surface.
Origin
Origin of the surface.
Period
The period of this face in the specified parametric direction.
 (Inherited from Face.)
Reference
Returns a stable reference to the face.
 (Inherited from Face.)
Vector |  Obsolete.
Defining vectors of the surface.
Visibility
The visibility.
 (Inherited from GeometryObject.)
XVector
The X-vector of the planar face.
YVector
The Y-vector of the planar face.
See Also
PlanarFace Class
Autodesk.Revit.DB Namespace